# Напишите программу, которая получает на вход число 0 или 1. 
# Единица означает, что дождь идёт. 
# В таком случае выводите на экран сообщение: «Пошёл дождь. Возьмите зонтик!». 
# Ноль означает, что дождя нет, 
# в этом случае надо вывести сообщение «Дождя нет!»

# Пример 1:
# На улице идёт дождь? 1
# Пошёл дождь. Возьмите зонтик!

# Пример 2:
# На улице идёт дождь? 0
# Дождя нет!

sensor = int(input("На улице идет дождь? "))
if sensor == 1:
    print("Пошёл дождь. Возьмите зонтик!")
if sensor == 0:
    print("Дождя нет!")

    
