# Задача 1. Ошибка
# В одном проекте на 10 000 строк кода произошла критическая ошибка. 
# Хорошо, что старший разработчик быстро её нашёл и исправил. 
# Он решил проверить, смогли бы вы её исправить, 
# если бы его не было на месте. 
# Поэтому он написал для вас код с аналогичной ошибкой:

# Суть кода в том, что у вас есть общий словарь из нескольких ключей, 
# значения которых равны ранее объявленным переменным. 
# Затем вызывается функция, которая должна изменять значения словаря, 
# добавляя к значениям случайное число, в зависимости от типа данных. 
# Но при этом меняются и ранее объявленные переменные. 
# Исправьте эту ошибку и убедитесь, 
# что nums_list, some_dict и uniq_nums не меняются.

