# Создать переменную с именем carname
# и присвоить значение Вольво

carname = 'Вольво'
print(carname)