# Задача 2. Вирус

# Ваня экспериментирует с различного рода компьютерными вирусами,
# которые портят жизнь людям. На просторах Интернета он нашёл код
# довольно необычного вируса, который “поворачивает” весь текст в
# документе и повторяет каждый символ 3 раза.

# Пользователь вводит текст. Напишите программу, которая
# выводит каждый символ текста в отдельной строке и три раза.

# Пример:
# Введите текст: Привет!
# ППП
# ррр
# иии
# ввв
# еее
# ттт
# !!!

text = input("Введите текст: ")
for symbol in text:
    print(symbol * 3)

# С разворотом(с использованием не изученных пока срезов):
# phrase_in = input("Введите текст: ")
# for symbol in phrase_in[::-1]:
#     print(symbol * 3)
