# Задача 1. Python!

# Напишите программу, которая выводит в отдельную строчку каждый
# символ фразы “Python!”.

for i in "Python":
    print(i)
