# Задача «Детали»

details_num = 500000000
price = 23.8589578
increase = 0.04578

print('На складе {:,d} деталей'.format(details_num))
print('Каждая деталь стоит {:.2f} рублей'.format(price))
print('Цена увеличилась на {:.1%}'.format(increase))
print('На складе {:.0e} деталей'.format(details_num))