# Задача 1. Настройка

# Вы устроились Python-разработчиком, и на новом рабочем месте уже стоит PyCharm. 
# Конечно же, прежде чем начать работать с кодом, вы хотите настроить его под себя, 
# чтобы чувствовать себя как дома.

# Перейдите в настройки PyCharm (File — Settings — Editor) и настройте среду разработки:

# Сделайте так, чтобы размер шрифта увеличивался при помощи комбинации Ctrl + колесо мыши.
# В разделе Font выберите наиболее подходящий вам стиль текста.
# В разделе Color Scheme выберите подходящий цвет IDE.
# Найдите раздел, который отвечает за стиль кода в Python, 
# и сравните с тем, что мы писали раньше.
