# Списки и их сортировка

# Списки в Python — это упорядоченные изменяемые коллекции объектов. 
# Они могут содержать данные разных типов, таких как числа, строки, списки.
# Списки в Python — мощный инструмент для работы с упорядоченными коллекциями данных, 
# а их гибкость используется во множестве сценариев программирования.

# Особенности и применение списков
# Списки в Python имеют следующие особенности: 

# Упорядоченность. Элементы списка хранятся в определённом порядке, 
# этот порядок сохраняется при выполнении операций над списком.

# Изменяемость. Списки могут быть изменены после создания. Это означает, что вы можете 
# добавлять, удалять и изменять элементы списка.

# Гибкость. Списки могут содержать элементы различных типов данных, и вы можете 
# комбинировать элементы в любом порядке и количестве.

# Списки используют: 

# Для хранения и обработки данных. Списки стоит выбрать для хранения данных, 
# если вам при хранении нужно будет изменять данные и сохранять порядок элементов.

# Для реализации стека и очереди. 

# Для работы с алгоритмами и структурами данных. Списки — основной инструмент для 
# реализации и использования различных алгоритмов и структур данных, включая 
# сортировку, поиск, объединение и другие операции.