# Задача 2. Вредоносное ПО

# Гера решил попрактиковаться в программировании и захотел написать небольшой скрипт, 
# который после двух сообщений отправляет ещё одно на основе первых двух.

# Пользователь вводит две строки. В каждой из них есть какое-то 
# количество специальных символов ! и ?. Напишите программу, 
# которая считает количество этих символов отдельно в первой 
# строке и отдельно во второй. Если в первой строке их больше, 
# чем во второй, то на экран выводится первая строчка, 
# объединённая со второй, а иначе — вторая с первой. 
# При равном количестве символов в строках выводится «Ой».

# Пример 1:

# Первое сообщение: Привет!
# Второе сообщение: Как дела? Что делаешь?
# Третье сообщение: Как дела? Что делаешь? Привет!


# Пример 2:
# Первое сообщение: Хм!!
# Второе сообщение: ?
# Третье сообщение: Хм!!?


message1 = input('Первое сообщение: ')
message2 = input('Второе сообщение: ')

count1 = message1.count('!') + message1.count('?')
count2 = message2.count('!') + message2.count('?')

