# Задача 2. Документация API
# Обычно к открытым API прилагается подробная документация, где описывается 
# логика формирования ссылок и какие данные по ним можно получать (или отправлять!).

# Изучите документацию того же сайта по «Звёздным войнам».

# Поэкспериментируйте с получением данных о кораблях, планетах, фильмах и так далее. 
# А ещё попробуйте библиотеку swapi (о ней также в документации) и с её помощью 
# выведите начало сюжета из фильма «Новая надежда» (A New Hope).


import requests
import json


my_req = requests.get('https://swapi.dev/api/')
print(my_req)
# Получаем <Response [200]> - запрос произведен успешно