# Задача 1. Создание кортежей

# Заполните один кортеж десятью случайными целыми числами от 0 до 5 
# включительно. Также заполните второй кортеж числами от −5 до 0. 
# Объедините два кортежа, создав тем самым третий кортеж. 
# С помощью метода кортежа определите в нём количество нулей. 
# Выведите на экран третий кортеж и количество нулей в нём.

import random

# a = [random.randint(0, 5) for _ in range(0, 5)]
tuple_1 = tuple(random.randint(0, 5) for _ in range(0, 5))

print(type(tuple_1), tuple_1)