# Задача 2. Случайная сумма
# Алексею по работе необходимо обрабатывать огромные массивы данных из миллионов элементов. 
# Каждый новый элемент — это сумма случайного вещественного числа от 0 до 1 и предыдущего 
# элемента (первый элемент — просто случайное вещественное число от 0 до 1). 
# Алексею нельзя хранить в памяти весь этот список, а со значениями работать как-то надо.

# Помогите Алексею, реализуйте такой класс-итератор и проверьте его работу. 
# Также сделайте, чтобы при каждом новом вызове итератора в цикле значения считались заново.

# Пример работы программы:
# Кол-во элементов: 5
# Элементы итератора:
# 0.74
# 1.13
# 1.95
# 2.2
# 2.55
# Новое кол-во элементов: 6
# Элементы итератора:
# 0.79
# 1.58
# 2.55
# 2.81
# 3.06
# 3.34

import random


class Iterator:

    def __init__(self, count):
        self.count = count
        self.first_elem = 0
        self.next_elem = 0


    def __iter__(self):
        return self
    
    def __next__(self):
        self.first_elem = round(random.random(), 2)
        self.new_elem = round(random.random() + self.first_elem, 2)
        return self.new_elem

amount = int(input("Кол-во элементов: "))
counter = Iterator(amount)
for elem in counter:
    print(elem)
