# Задача 1. Заказ фруктов
# В торговую компанию пришёл заказ:

# Ключи — названия товаров, значения — необходимое количество килограммов.
# При помощи метода get и установки значения по умолчанию проверьте, 
# есть ли товар на складе, и получите его цену. Если товара нет, 
# то по умолчанию получите 0. Подсчитайте итоговую выручку компании по имеющимся товарам.

# Ключи — названия товаров, значения — цена за один килограмм.
# Напишите программу, которая суммирует стоимость (цена × количество) 
# всех заказанных товаров, и выведите итоговую сумму в консоль.


order = {
    'apple': 2, 
    'banana': 3, 
    'pear': 1, 
    'watermelon': 10, 
    'chocolate': 5
}

incomes = {
    'apple': 5600.20,
    'orange': 3500.45,
    'banana': 5000.00,
    'bergamot': 3700.56,
    'durian': 5987.23,
    'grapefruit': 300.40,
    'peach': 10000.50,
    'pear': 1020.00,
    'persimmon': 310.00,
}

for i_order in order.keys():
    if i_order in incomes:
        print(i_order, ':', incomes[i_order] * order[i_order])
    else:
        print(i_order, ':', 0)
        
print('summa = ', sum(incomes[i_order] * order[i_order]))

