# Задание 1. Песни — 2

# Продолжим писать приложение для удобного прослушивания музыки, 
# но теперь песни хранятся в виде словаря, а не в виде вложенных списков. 
# Каждая песня состоит из названия и продолжительности 
# с точностью до долей минут.

# Напишите программу, которая запрашивает у пользователя количество 
# песен из списка и их названия, а на экран выводит общее время их звучания.

# Пример
# Сколько песен выбрать? 3
# Название первой песни: Halo
# Название второй песни: Enjoy the Silence
# Название третьей песни: Clean
# Общее время звучания песен: 14,93 минуты

