# Задача 1. Квадраты чисел

# Напишите программу, которая выводит квадраты чисел от 0 до 10. 
# Для этого используйте цикл for и функцию range.

for number in range(11):
    print(number ** 2)
    
