# Напишите функцию is_palindrome(s), которая принимает строку s и возвращает True, 
# если строка является палиндромом, и False в противном случае. Палиндром - 
# это строка, которая читается одинаково слева направо и справа налево, 
# игнорируя пробелы, знаки препинания и регистр.

# Примеры:


def is_palindrome(text: str) -> bool:

    pass



print(is_palindrome("radar"))  # True
print(is_palindrome("A man a plan a canal Panama"))  # True
print(is_palindrome("hello"))  # False