# 19.2 Библиотека pyTelegramBotAPI

# Онбординг
# Хорошие примеры
# П: «Привет!»
# Б: «Привет! Я виртуальный ассистент компании XXX. Я отвечу на ваши вопросы о компании, 
# нашей продукции, помогу сделать заказ. Какой у вас вопрос?»
# П: «Привет!»
# Б: «Привет! Я бот по поиску отелей. Смогу подобрать для вас подходящие отели, где бы 
# вы ни были. В каком городе хотите найти отель? Для подробного описания моих 
# возможностей напишите /help».

# Подсказки
# Хороший пример
# Б: «Результаты по вашему запросу:...
# Для продолжения введите новый запрос или одну из следующих команд:...».

# Обработка ошибок
# Хорошие примеры
# Б: «Выберите количество товаров».
# П: «Сколько времени?»
# Б: «Извините, я вас не понимаю. Введите количество товаров или 
# напишите /help для получения справки».
# Б: «Выберите количество товаров».
# П: «750».
# Б: «Ожидается число от 1 до 100».

# Вариативность
# Хороший пример
# П: «Привет, бот!»
# Б: «Рад вас снова видеть, Александр!»

# =======================================================================================
# Разработка телеграм-бота
