# Задача 2. Всё в одном
# Ваш друг, который тоже проходит курс Python Basic, поехал с ноутбуком 
# в другой город, и там у него случилась беда: его диск пришлось отформатировать, 
# а доступ в интернет отсутствует. Остался только телефон с мобильным интернетом. 
# Так как со связью (и с памятью) проблемы, друг попросил вас скинуть одним файлом 
# все решения и скрипты, которые у вас сейчас есть.

# Напишите программу, которая копирует код каждого скрипта в папке проекта 
# python_basic в файл scripts.txt, разделяя код строкой из 40 символов *. 

import os
